'''
1. 지금 입은 하의 색깔을 물어보는 input 함수를 작성, pants_color라는 변수에 저장.

2. 마지막으로 먹은 음식을 믈어보는 input 함수 작성, last_food라는 변수에 저장.

3. f-string을 활용.
'''
logo='''
                                                                                               
                                                                                               
                                                                                ____           
  ,---,                                  ,---,                                ,'  , `.         
,---.'|                      ,---,     ,---.'|      ,---,                  ,-+-,.' _ |         
|   | :                  ,-+-. /  |    |   | :  ,-+-. /  |              ,-+-. ;   , ||         
:   : :      ,--.--.    ,--.'|'   |    |   | | ,--.'|'   |  ,--.--.    ,--.'|'   |  || ,---.   
:     |,-.  /       \  |   |  ,"' |  ,--.__| ||   |  ,"' | /       \  |   |  ,', |  |,/     \  
|   : '  | .--.  .-. | |   | /  | | /   ,'   ||   | /  | |.--.  .-. | |   | /  | |--'/    /  | 
|   |  / :  \__\/: . . |   | |  | |.   '  /  ||   | |  | | \__\/: . . |   : |  | ,  .    ' / | 
'   : |: |  ," .--.; | |   | |  |/ '   ; |:  ||   | |  |/  ," .--.; | |   : |  |/   '   ;   /| 
|   | '/ : /  /  ,.  | |   | |--'  |   | '/  '|   | |--'  /  /  ,.  | |   | |`-'    '   |  / | 
|   :    |;  :   .'   \|   |/      |   :    :||   |/     ;  :   .'   \|   ;/        |   :    | 
/    \  / |  ,     .-./'---'        \   \  /  '---'      |  ,     .-./'---'          \   \  /  
`-'----'   `--`---'                  `----'               `--`---'                    `----'   
                                                                                               
'''

# print(logo)
pants_color= input("지금 입은 하의 색깔은 무엇입니까? >>>")
last_food= input("마지막으로 먹은 음식은 무엇입니까? >>>")
# print(f"당신의 밴드 이름은 {pants_color} {last_food} 입니다.")
band_name= pants_color+" "+last_food
print(f"당신의 밴드 이름은 {band_name}입니다. ")


